# Importing packages

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import matplotlib.patheffects as path_effects
import seaborn as sns
import warnings

%matplotlib inline
sns.set(style='ticks', font_scale=1.2)
warnings.filterwarnings('ignore')

# Data Ingestion

## Loading data

In [2]:
try :
    ca = pd.read_excel('./Credit Card Data.xlsx', sheet_name='Customer Acqusition')
    r = pd.read_excel('./Credit Card Data.xlsx', sheet_name='Repayment')
    s = pd.read_excel('./Credit Card Data.xlsx', sheet_name='Spend')
except :
    ca = pd.read_csv('./Customer Acqusition.csv')
    r = pd.read_csv('./Repayment.csv')
    s = pd.read_csv('./spend.csv')

### Customer Acquisition

In [3]:
ca.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   No        100 non-null    int64
 1   Customer  100 non-null    object
 2   Age       100 non-null    float64
 3   City      100 non-null    object
 4   Product   100 non-null    object
 5   Limit     100 non-null    int64
 6   Company   100 non-null    object
 7   Segment   100 non-null    object
dtypes: float64(1), int64(2), object(5)
memory usage: 6.4+ KB

In [4]:
ca.head()

   No Customer        Age       City   Product   Limit Company        Segment
0   1       A1  19.389224  BANGALORE      Gold  500000      C1  Self Employed
1   2       A2  27.422016   CALCUTTA    Silver  100000      C2   Salaried_MNC
2   3       A3  76.317327     COCHIN  Platimum   10000      C3   Salaried_Pvt
3   4       A4  69.117125     BOMBAY  Platimum   10001      C4           Govt
4   5       A5  43.681079  BANGALORE  Platimum   10002      C5  Normal Salary

In [5]:
# Fixing column names
ca.columns = ca.columns.str.lower().str.strip()

In [6]:
ca.isnull().sum()

no          0
customer    0
age         0
city        0
product     0
limit       0
company     0
segment     0
dtype: int64

In [7]:
print(ca.shape)
ca.drop_duplicates(inplace=True)
print(ca.shape)

(100, 8)
(100, 8)

### Repayment

In [8]:
r.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500 entries, 0 to 1499
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   SL No:    1500 non-null   int64
 1   Customer  1500 non-null   object
 2   Month     1500 non-null   datetime64[ns]
 3   Amount    1500 non-null   float64
dtypes: datetime64[ns](1), float64(1), int64(1), object(1)
memory usage: 47.0+ KB

In [9]:
r.head()

   SL No: Customer      Month         Amount
0       1       A1 2004-01-12  338932.141919
1       2       A1 2004-01-03  131778.688758
2       3       A1 2004-01-15  485981.516736
3       4       A1 2004-01-25  452865.826385
4       5       A1 2005-01-17  154684.838196

In [10]:
# Fixing column names
r.columns = r.columns.str.lower().str.strip().str.replace(' ', '_').str.replace(':', '')
r.rename(columns={'month' : 'r_date', 'amount' : 'r_amount'}, inplace=True)

In [11]:
r.isnull().sum()

sl_no       0
customer    0
r_date      0
r_amount    0
dtype: int64

In [12]:
print(r.shape)
r.drop_duplicates(inplace=True)
print(r.shape)

(1500, 4)
(1500, 4)

### Spend

In [13]:
s.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500 entries, 0 to 1499
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Sl No:    1500 non-null   int64
 1   Customer  1500 non-null   object
 2   Month     1500 non-null   datetime64[ns]
 3   Type      1500 non-null   object
 4   Amount    1500 non-null   float64
dtypes: datetime64[ns](1), float64(1), int64(1), object(2)
memory usage: 58.7+ KB

In [14]:
s.head()

   Sl No: Customer      Month       Type         Amount
0       1       A1 2004-01-12  JEWELLERY  344054.980813
1       2       A1 2004-01-03      PETRO  467747.601626
2       3       A1 2004-01-15    CLOTHES   86878.954735
3       4       A1 2004-01-25       FOOD  269175.011875
4       5       A1 2005-01-17     CAMERA    3406.639477

In [15]:
# Fixing column names
s.columns = s.columns.str.lower().str.strip().str.replace(' ', '_').str.replace(':', '')
s.rename(columns={'month' : 's_date', 'amount' : 's_amount'}, inplace=True)

In [16]:
s.isnull().sum()

sl_no       0
customer    0
s_date      0
type        0
s_amount    0
dtype: int64

In [17]:
print(s.shape)
s.drop_duplicates(inplace=True)
print(s.shape)

(1500, 5)
(1500, 5)

## Creating Final Table

In [18]:
df = pd.merge(pd.merge(ca, r, on='customer'), s, on='customer')
df.head()

,no,customer,age,city,product,limit,company,segment,sl_no_x,r_date,r_amount,sl_no_y,s_date,type,s_amount
0,1,A1,19.389224,BANGALORE,Gold,500000,C1,Self Employed,1,2004-01-12,338932.141919,1,2004-01-12,JEWELLERY,344054.980813
1,1,A1,19.389224,BANGALORE,Gold,500000,C1,Self Employed,1,2004-01-12,338932.141919,2,2004-01-03,PETRO,467747.601626
2,1,A1,19.389224,BANGALORE,Gold,500000,C1,Self Employed,1,2004-01-12,338932.141919,3,2004-01-15,CLOTHES,86878.954735
3,1,A1,19.389224,BANGALORE,Gold,500000,C1,Self Employed,1,2004-01-12,338932.141919,4,2004-01-25,FOOD,269175.011875
4,1,A1,19.389224,BANGALORE,Gold,500000,C1,Self Employed,1,2004-01-12,338932.141919,5,2005-01-17,CAMERA,3406.639477

In [19]:
df.shape

(37284, 15)

<p style="background-color:Blue; color:White; text-align: center; font-size:16px; font-family:Monospace"><b>
##################################<br>
## Data Ingestion is completed. ##<br>
##################################
</p>

# Exploratory Data Analysis

## Q1
> 1. In the above dataset,
     - a. In case age is less than 18, replace it with mean of age values. <br>
     - b. In case spend amount is more than the limit, replace it with 50% of that customer’s limit. (customer’s limit provided in acquisition table is the per transaction limit on his card)<br>
     - c. Incase the repayment amount is more than the limit, replace the repayment with the
limit.

### a. In case age is less than 18, replace it with mean of age values.

In [20]:
print(df.age[df.age < 18].count())
df.age[df.age < 18] = ca.age.mean()
print(df.age[df.age < 18].count())

7110
0

### b. In case spend amount is more than the limit, replace it with 50% of that customer’s limit.

In [37]:
df.s_amount = df.apply(lambda x: x.limit * 0.5
                       if x.s_amount > x.limit 
                       else x.s_amount,
                       axis=1)
df[df.s_amount == df.limit / 2].head()

,no,customer,age,city,product,limit,company,segment,sl_no_x,r_date,r_amount,sl_no_y,s_date,type,s_amount
325,2,A2,27.422016,CALCUTTA,Silver,100000,C2,Salaried_MNC,104,2004-01-03,447693.67793,118,2005-02-28,TRAIN TICKET,50000.0
327,2,A2,27.422016,CALCUTTA,Silver,100000,C2,Salaried_MNC,104,2004-01-03,447693.67793,146,2004-11-23,PETRO,50000.0
328,2,A2,27.422016,CALCUTTA,Silver,100000,C2,Salaried_MNC,104,2004-01-03,447693.67793,160,2005-09-03,JEWELLERY,50000.0
329,2,A2,27.422016,CALCUTTA,Silver,100000,C2,Salaried_MNC,104,2004-01-03,447693.67793,174,2006-11-03,MOVIE TICKET,50000.0
330,2,A2,27.422016,CALCUTTA,Silver,100000,C2,Salaried_MNC,104,2004-01-03,447693.67793,188,2006-02-04,FOOD,50000.0

### c. In case the repayment amount is more than the limit, replace the repayment with the limit.

In [38]:
df.r_amount = df.apply(lambda x: x.limit
                       if x.r_amount > x.limit 
                       else x.r_amount,
                       axis=1)
df[df.r_amount == df.limit].head()

,no,customer,age,city,product,limit,company,segment,sl_no_x,r_date,r_amount,sl_no_y,s_date,type,s_amount
324,2,A2,27.422016,CALCUTTA,Silver,100000,C2,Salaried_MNC,104,2004-01-03,100000.0,104,2004-01-03,RENTAL,84410.235370
325,2,A2,27.422016,CALCUTTA,Silver,100000,C2,Salaried_MNC,104,2004-01-03,100000.0,118,2005-02-28,TRAIN TICKET,50000.000000
326,2,A2,27.422016,CALCUTTA,Silver,100000,C2,Salaried_MNC,104,2004-01-03,100000.0,132,2004-04-06,BUS TICKET,80125.398177
327,2,A2,27.422016,CALCUTTA,Silver,100000,C2,Salaried_MNC,104,2004-01-03,100000.0,146,2004-11-23,PETRO,50000.000000
328,2,A2,27.422016,CALCUTTA,Silver,100000,C2,Salaried_MNC,104,2004-01-03,100000.0,160,2005-09-03,JEWELLERY,50000.000000

## Q2

> 2. From the above dataset create the following summaries:
    - a. How many distinct customers exist?
    - b. How many distinct categories exist?
    - c. What is the average monthly spend by customers?
    - d. What is the average monthly repayment by customers?
    - e. If the monthly rate of interest is 2.9%, what is the profit for the bank for each month? (Profit is defined as interest earned on Monthly Profit. **Monthly Profit = Monthly repayment – Monthly spend**. Interest is earned only on positive profits and not on negative amounts)
    - f. What are the top 5 product types?
    - g. Which city is having maximum spend?
    - h. Which age group is spending more money?
    - i. Who are the top 10 customers in terms of repayment?

## Q3

> 3. Calculate the city wise spend on each product on yearly basis. Also include a graphical
representation for the same.

## Q4

> 4. Create graphs for
    - a. Monthly comparison of total spends, city wise
    - b. Comparison of yearly spend on air tickets
    - c. Comparison of monthly spend for each product (look for any seasonality that exists in terms of spend)

## Q5

> 5. Write user defined PYTHON function to perform the following analysis:
You need to find top 10 customers for each city in terms of their repayment amount by
different products and by different time periods i.e. year or month. The user should be able
to specify the product (Gold/Silver/Platinum) and time period (yearly or monthly) and the
function should automatically take these inputs while identifying the top 10 customers.